; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v10)
             (pred_11 ?v8 ?v2)
             (pred_6 ?v9 ?v2)
             (pred_9 ?v5 ?v9 )
	     (pred_1 ?v9)
             (pred_3 ?v13)
             (pred_2 ?v8)
             (pred_12 ?v2)
             (pred_7 ?v9)
             (pred_8 ?v8)
             (pred_5 ?v9)
             (pred_4 ))



(:action op_5
:parameters (?v11 ?v1 ?v6 ?v12)
:precondition (and (pred_3 ?v11) (pred_3 ?v1) (pred_2 ?v6) (pred_12 ?v12)
          (pred_10 ?v11 ?v1) (pred_11 ?v6 ?v12)
                   (pred_6 ?v1 ?v12) (pred_1 ?v11) 
                   (pred_7 ?v1) (pred_8 ?v6))
:effect (and  (pred_5 ?v1) (not (pred_7 ?v1))))


(:action op_2
:parameters (?v11 ?v3)
:precondition (and (pred_3 ?v11) (pred_3 ?v3)
               (pred_1 ?v11) (pred_10 ?v11 ?v3) (pred_5 ?v3))
:effect (and (pred_1 ?v3) (not (pred_1 ?v11))))

(:action op_1
:parameters (?v11 ?v6)
:precondition (and (pred_3 ?v11) (pred_2 ?v6) 
                  (pred_1 ?v11) (pred_9 ?v6 ?v11) (pred_4 ))
:effect (and (pred_8 ?v6)
   (not (pred_9 ?v6 ?v11)) (not (pred_4 ))))


(:action op_3
:parameters (?v11 ?v4 ?v7)
:precondition (and (pred_3 ?v11) (pred_2 ?v4) (pred_2 ?v7)
                  (pred_1 ?v11) (pred_8 ?v7) (pred_9 ?v4 ?v11))
:effect (and (pred_8 ?v4) (pred_9 ?v7 ?v11)
        (not (pred_8 ?v7)) (not (pred_9 ?v4 ?v11))))

(:action op_4
:parameters (?v11 ?v6)
:precondition (and (pred_3 ?v11) (pred_2 ?v6) 
                  (pred_1 ?v11) (pred_8 ?v6))
:effect (and (pred_4 ) (pred_9 ?v6 ?v11) (not (pred_8 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_05 obj_18 obj_25 obj_04 obj_12 obj_07 obj_06 obj_19 obj_27 obj_01 obj_23 obj_26 obj_20 obj_02 obj_28 obj_15 obj_16 obj_17 obj_08 obj_13 obj_31 obj_30 obj_09 obj_14
    obj_29 obj_24 obj_03
    obj_11 obj_10 obj_21
    )

    (:init
       (pred_4)

       (pred_3 obj_22)
       (pred_3 obj_05)
       (pred_3 obj_18)
       (pred_3 obj_25)
       (pred_3 obj_04)
       (pred_3 obj_12)
       (pred_3 obj_07)
       (pred_3 obj_06)
       (pred_3 obj_19)
       (pred_3 obj_27)
       (pred_3 obj_01)
       (pred_3 obj_23)
       (pred_3 obj_26)
       (pred_3 obj_20)
       (pred_3 obj_02)
       (pred_3 obj_28)
       (pred_3 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_17)
       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_3 obj_31)
       (pred_3 obj_30)
       (pred_3 obj_09)
       (pred_3 obj_14)
       (pred_12 obj_29)
       (pred_12 obj_24)
       (pred_12 obj_03)
       (pred_2 obj_11)
       (pred_2 obj_10)
       (pred_2 obj_21)

       (pred_10 obj_22 obj_12)
       (pred_10 obj_22 obj_05)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_05 obj_18)
       (pred_10 obj_05 obj_22)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_18 obj_25)
       (pred_10 obj_18 obj_05)
       (pred_10 obj_25 obj_19)
       (pred_10 obj_25 obj_04)
       (pred_10 obj_25 obj_18)
       (pred_10 obj_04 obj_27)
       (pred_10 obj_04 obj_25)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_12 obj_07)
       (pred_10 obj_12 obj_22)
       (pred_10 obj_07 obj_23)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_07 obj_05)
       (pred_10 obj_07 obj_12)
       (pred_10 obj_06 obj_26)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_27)
       (pred_10 obj_19 obj_25)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_27 obj_02)
       (pred_10 obj_27 obj_04)
       (pred_10 obj_27 obj_19)
       (pred_10 obj_01 obj_28)
       (pred_10 obj_01 obj_23)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_23 obj_15)
       (pred_10 obj_23 obj_26)
       (pred_10 obj_23 obj_07)
       (pred_10 obj_23 obj_01)
       (pred_10 obj_26 obj_16)
       (pred_10 obj_26 obj_20)
       (pred_10 obj_26 obj_06)
       (pred_10 obj_26 obj_23)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_26)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_27)
       (pred_10 obj_02 obj_20)
       (pred_10 obj_28 obj_13)
       (pred_10 obj_28 obj_15)
       (pred_10 obj_28 obj_01)
       (pred_10 obj_15 obj_31)
       (pred_10 obj_15 obj_16)
       (pred_10 obj_15 obj_23)
       (pred_10 obj_15 obj_28)
       (pred_10 obj_16 obj_30)
       (pred_10 obj_16 obj_17)
       (pred_10 obj_16 obj_26)
       (pred_10 obj_16 obj_15)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_17 obj_08)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_16)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_13 obj_31)
       (pred_10 obj_13 obj_28)
       (pred_10 obj_31 obj_30)
       (pred_10 obj_31 obj_15)
       (pred_10 obj_31 obj_13)
       (pred_10 obj_30 obj_09)
       (pred_10 obj_30 obj_16)
       (pred_10 obj_30 obj_31)
       (pred_10 obj_09 obj_14)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_09 obj_30)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_09)
       (pred_7 obj_07)
       (pred_7 obj_19)
       (pred_7 obj_14)
       (pred_6  obj_07 obj_29)
       (pred_6  obj_19 obj_24)
       (pred_6  obj_14 obj_03)
       (pred_5 obj_22)
       (pred_5 obj_05)
       (pred_5 obj_18)
       (pred_5 obj_25)
       (pred_5 obj_04)
       (pred_5 obj_12)
       (pred_5 obj_06)
       (pred_5 obj_27)
       (pred_5 obj_01)
       (pred_5 obj_23)
       (pred_5 obj_26)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_28)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_31)
       (pred_5 obj_30)
       (pred_5 obj_09)

       (pred_11  obj_11 obj_29)
       (pred_11  obj_10 obj_24)
       (pred_11  obj_21 obj_03)
       (pred_9 obj_11 obj_26)
       (pred_9 obj_10 obj_31)
       (pred_9 obj_21 obj_13)
       (pred_1 obj_26)
    )

    (:goal (and
       (pred_9 obj_21 obj_16)
    ))
(:constraints
  (always (not (pred_1 obj_15)))
)
)

; plan
1. (op_2 obj_26 obj_16)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_16)
   goals met: 0 of 1
2. (op_2 obj_16 obj_30)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_30)
   goals met: 0 of 1
3. (op_2 obj_30 obj_31)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_31)
   goals met: 0 of 1
4. (op_2 obj_31 obj_13)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_13)
   goals met: 0 of 1
5. (op_1 obj_13 obj_21)
   deleted: (pred_9 obj_21 obj_13) (pred_4)
   added: (pred_8 obj_21)
   goals met: 0 of 1
6. (op_2 obj_13 obj_31)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_31)
   goals met: 0 of 1
7. (op_2 obj_31 obj_30)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_30)
   goals met: 0 of 1
8. (op_2 obj_30 obj_16)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_16)
   goals met: 0 of 1
9. (op_4 obj_16 obj_21)
   deleted: (pred_8 obj_21)
   added: (pred_4) (pred_9 obj_21 obj_16)
   goals met: 1 of 1
